{
  "backend/main.mo": "Defines user profiles, notes, likes, and access‑controlled CRUD operations with map‑based storage and sorting utilities.",
  "feature_evidence.json": "Describes a feature report linking a background image feature to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files covering styling, hooks, components, and app logic.",
  "frontend/index.css": "Sets global Tailwind CSS variables and theme tokens for light and dark modes using OKLCH values.",
  "frontend/index.html": "Base HTML file loading the app root and applying persisted theme before rendering.",
  "frontend/src/App.tsx": "Root app component with error boundary, login screen, auth gating, profile setup flow, and main feed wrapped in background and watermarks.",
  "frontend/src/components/AdminModerationQueueDialog.tsx": "Empty placeholder file for an admin moderation dialog component.",
  "frontend/src/components/CommentWithAvatar.tsx": "Renders a comment with user avatar and metadata using public profile lookup.",
  "frontend/src/components/CornerWatermark.tsx": "Displays a fixed footer watermark with theme‑aware styling.",
  "frontend/src/components/Feedback.tsx": "Provides reusable loading, empty, and error UI states with retry support.",
  "frontend/src/components/FeedBackground.tsx": "Wraps content with a fixed background image and overlay for readable contrast.",
  "frontend/src/components/Layout.tsx": "Top‑level layout with header, footer, sidebar, profile editing, and authenticated user avatar display.",
  "frontend/src/components/LikeButton.tsx": "Renders a like button that triggers a like mutation, prevents double likes, and displays the current like count.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling login state and errors.",
  "frontend/src/components/NoteActions.tsx": "Offers star, pin, edit, delete, and report actions for a note with permission checks and confirmation dialogs.",
  "frontend/src/components/NoteCard.tsx": "Displays a summary card for a note with metadata, author info, truncated text, and a like button.",
  "frontend/src/components/NoteForm.tsx": "Form for creating or editing notes with validation, mutation calls, and success/error handling.",
  "frontend/src/components/NoteLikersDialog.tsx": "Dialog showing a list of users who liked a note, with loading, error, and empty states.",
  "frontend/src/components/NoteReaderSheet.tsx": "Slide‑over reader showing full note details with actions, like controls, and author info.",
  "frontend/src/components/NotesFeed.tsx": "Displays a searchable, paginated list of notes with sorting, creation, and editing, handling loading, errors, and profile checks.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for creating or editing a user profile, including validation and profile photo upload/removal.",
  "frontend/src/components/SidebarDrawer.tsx": "Left-side drawer providing theme toggle and access to the user directory dialog.",
  "frontend/src/components/Toasts.tsx": "Provides a top‑center toaster for global notifications.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user avatar with photo or initials and manages profile photo URL lifecycle.",
  "frontend/src/components/UserDirectoryDialog.tsx": "Dialog listing all users with search, loading states, and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuthorization.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for fetching and saving the current user’s profile with react‑query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context for Internet Identity, handling login, logout, and identity restoration.",
  "frontend/src/hooks/useLikedNotes.ts": "Manages liked note IDs per user principal using localStorage and provides helpers to check and mark likes.",
  "frontend/src/hooks/useNoteLikers.ts": "Fetches the list of users who liked a specific note via react-query and the actor API.",
  "frontend/src/hooks/useNotes.ts": "Provides note list and single-note fetch hooks with polling and caching via react-query.",
  "frontend/src/hooks/useNotesMutations.ts": "Defines mutations for creating, updating, deleting, liking, starring/pinning, and reporting notes with cache invalidation.",
  "frontend/src/hooks/useProfilePhotoMutations.ts": "Adds and removes the caller's profile photo and refreshes related profile caches.",
  "frontend/src/hooks/usePublicUserProfile.ts": "Fetches a public user profile by principal for displaying avatars.",
  "frontend/src/hooks/useResumeRefresh.ts": "Refreshes note data when the page regains focus or is restored from bfcache.",
  "frontend/src/hooks/useTheme.ts": "Stores and toggles light/dark theme preference with localStorage and DOM class updates.",
  "frontend/src/hooks/useUserDirectory.ts": "Fetches the full user directory from the backend with loading state helpers.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light and dark modes with UI tweaks.",
  "frontend/src/lib/cacheKeys.ts": "Centralized react-query cache key definitions for notes and user profiles.",
  "frontend/src/lib/errors.ts": "Normalizes errors into readable messages and identifies retryable error types.",
  "frontend/src/lib/profilePhoto.ts": "Utilities for converting profile photo bytes to URLs, cleaning them up, validating files, and converting files for upload.",
  "frontend/src/main.tsx": "Initializes the React app with react-query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, sizing, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project's current state, features, architecture decisions, and known issues for a mobile‑optimized collaborative notes web app."
}