{
  "backend/main.mo": "Motoko backend defining user profiles, notes, access control, and CRUD operations including sorting and ownership checks.",
  "feature_evidence.json": "Feature evidence report listing features, involved files, components, and test IDs for recent additions like note likers.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles, styling, hooks, and components.",
  "frontend/index.css": "Root Tailwind setup defining OKLCH-based light/dark theme tokens and base styles.",
  "frontend/index.html": "HTML entrypoint setting theme before render and loading the main React app.",
  "frontend/src/App.tsx": "Root React component with error boundary, login screen, profile flow, main feed, and global UI elements.",
  "frontend/src/components/AdminModerationQueueDialog.tsx": "Empty placeholder file for the admin moderation queue dialog.",
  "frontend/src/components/CornerWatermark.tsx": "Simple fixed-position watermark showing the text 'Aman SN'.",
  "frontend/src/components/Feedback.tsx": "Shared UI states for loading, empty, and error displays with retry support.",
  "frontend/src/components/Layout.tsx": "Top-level layout containing header, footer, sidebar trigger, and profile editing entry point.",
  "frontend/src/components/LikeButton.tsx": "Renders a like button that triggers a like mutation, updates local liked state, and shows toast feedback.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that logs users in or out using Internet Identity and handles login edge cases.",
  "frontend/src/components/NoteActions.tsx": "Provides star, pin, edit, and delete actions for a note with optional dropdown or inline variants.",
  "frontend/src/components/NoteCard.tsx": "Displays a concise note preview with metadata, truncated text, and an embedded like button.",
  "frontend/src/components/NoteForm.tsx": "Form modal for creating or editing notes with validation and mutation handling.",
  "frontend/src/components/NoteLikersDialog.tsx": "Dialog showing the list of users who liked a note, with loading, error, and empty states.",
  "frontend/src/components/NoteReaderSheet.tsx": "Right-side sheet that displays full note details with actions, likes, and likers list.",
  "frontend/src/components/NotesFeed.tsx": "Main notes list with search, sorting, pagination, note creation, and note viewer integration.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal form to create or edit a user profile, handling validation and saving via a mutation hook.",
  "frontend/src/components/SidebarDrawer.tsx": "Left-side drawer with a settings panel allowing users to toggle dark mode.",
  "frontend/src/components/Toasts.tsx": "Wrapper component that renders the global toast provider.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAuthorization.ts": "Empty placeholder file for authorization logic.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and update the current user's profile through the actor with react-query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useLikedNotes.ts": "Manages locally stored liked-note IDs per user, exposing helpers to check and mark likes.",
  "frontend/src/hooks/useNoteLikers.ts": "Fetches the list of users who liked a specific note using the actor.",
  "frontend/src/hooks/useNotes.ts": "Hooks for listing notes and fetching individual notes with polling and caching.",
  "frontend/src/hooks/useNotesMutations.ts": "Provides create, update, delete, star/pin toggle, and like mutations for notes with cache invalidation.",
  "frontend/src/hooks/useResumeRefresh.ts": "Refreshes note queries when the page regains focus or is restored from bfcache.",
  "frontend/src/hooks/useTheme.ts": "Handles light/dark theme state with localStorage persistence and DOM class updates.",
  "frontend/src/index.css": "Defines Tailwind layers, OKLCH-based light/dark theme CSS variables, and global typography and utility styles.",
  "frontend/src/lib/cacheKeys.ts": "Provides React Query cache key generators for notes, users, and related data.",
  "frontend/src/lib/errors.ts": "Normalizes error messages and identifies retryable network-related errors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, OKLCH color tokens, typography, animations, and plugins.",
  "project_state.json": "Describes the project’s state, features, requirements, architecture notes, and known issues."
}