{
  "kind": "build_request",
  "title": "Set uploaded image as background behind the main notes feed",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-60",
      "text": "Set the user-uploaded image file \"WhatsApp Image 2026-02-09 at 8.24.07 PM.jpeg\" as a background behind the main notes feed content (the authenticated NotesFeed screen), so the notes/cards render on top of the image with readable contrast in both light and dark themes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3",
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "ADD  THIS IMAGE ON FRONT OFF APP",
          "THE MAIN FEED",
          "AS A BACKGROUND BEHIND THE FEED CONTENT",
          "BUILD"
        ]
      },
      "acceptanceCriteria": [
        "The image is added to the frontend as a static asset (do not serve it from the backend) and is used as the background on the main feed screen where NotesFeed is rendered.",
        "The background image appears behind the feed UI (search bar, Create Note button, note cards/grid, and feed footer text) and does not break scrolling or click interactions on note cards/buttons.",
        "Readability is preserved: an overlay/tint and/or background blur is applied so text and cards remain legible in both light and dark mode.",
        "The header, sidebar drawer, watermark, toasts, and other non-feed screens (e.g., login screen, profile setup) keep their existing appearance unless they already share the same feed container area.",
        "No user-facing text changes are introduced (English remains for any UI text that already exists)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend unchanged (no new Motoko APIs, no schema/migration changes) for this request.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not implement in-app notifications for new notes or likes as part of this request.",
    "Do not change the overall app navigation, authentication flow, or note CRUD behavior.",
    "Do not add admin/moderation workflows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}