{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Static background image behind authenticated NotesFeed content",
  "requirements": [
    {
      "id": "REQ-60",
      "summary": "Add the provided JPEG as a static frontend asset and render it as a theme-aware, readable background behind the authenticated NotesFeed content only (without affecting header/sidebar/watermark/toasts or other screens).",
      "acceptanceCriteria": [
        "The image is added to the frontend as a static asset (do not serve it from the backend) and is used as the background on the main feed screen where NotesFeed is rendered.",
        "The background image appears behind the feed UI (search bar, Create Note button, note cards/grid, and feed footer text) and does not break scrolling or click interactions on note cards/buttons.",
        "Readability is preserved: an overlay/tint and/or background blur is applied so text and cards remain legible in both light and dark mode.",
        "The header, sidebar drawer, watermark, toasts, and other non-feed screens (e.g., login screen, profile setup) keep their existing appearance unless they already share the same feed container area.",
        "No user-facing text changes are introduced (English remains for any UI text that already exists)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/WhatsApp Image 2026-02-09 at 8.24.07 PM.jpeg",
          "operation": "create",
          "description": "Add the provided static background image asset to the frontend public assets so it can be referenced by the feed background styling (do not involve the backend)."
        },
        {
          "path": "frontend/src/components/FeedBackground.tsx",
          "operation": "create",
          "description": "Create a small wrapper component that renders a background image layer (non-interactive) behind its children with a theme-aware overlay/tint and optional blur, ensuring the content layer stays clickable and scrollable."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add theme-aware CSS utility/classes for the feed background wrapper (background image positioning, overlay opacity for light/dark, optional blur) and ensure the background layer uses pointer-events: none so it does not block interactions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the authenticated NotesFeed render path with the new FeedBackground component so the image appears only behind the main notes feed content (and not on login/profile setup screens), keeping header/sidebar/watermark/toasts unchanged."
        }
      ]
    }
  ]
}